In [9]:
import numpy as np
myliste=[[10,20,30], [20,30,40], [40,50,60]]
mylistem= np.array(myliste)
mylistem[1:,2]
mylistem[0:,1]

array([20, 30, 50])

In [10]:
import numpy as np
import pandas as pd

mysozluk={"Kübra": 60, "Esma": 50}
pd.Series(mysozluk)

Kübra    60
Esma     50
dtype: int64

In [28]:
import numpy as np
import pandas as pd
data= np.random.randn(4,3)
data

array([[ 2.54337685, -2.30022519, -1.56188038],
       [ 0.66207965,  1.3709016 ,  0.52936995],
       [ 0.92234925, -0.42125993,  1.45675909],
       [ 1.86272011,  0.50167885,  1.23759139]])

In [29]:
dataFrame= pd.DataFrame(data)
dataFrame

          0         1         2
0  2.543377 -2.300225 -1.561880
1  0.662080  1.370902  0.529370
2  0.922349 -0.421260  1.456759
3  1.862720  0.501679  1.237591

In [30]:
yeniDataFrame= pd.DataFrame(data, index=["Atil", "zeynep","atlas", "mehmet"], columns= [ "maas", "yas", "calısma saati"])
yeniDataFrame

            maas       yas  calısma saati
Atil    2.543377 -2.300225      -1.561880
zeynep  0.662080  1.370902       0.529370
atlas   0.922349 -0.421260       1.456759
mehmet  1.862720  0.501679       1.237591

In [31]:
yeniDataFrame["yas"]

Atil     -2.300225
zeynep    1.370902
atlas    -0.421260
mehmet    0.501679
Name: yas, dtype: float64

In [32]:
yeniDataFrame[["maas", "yas"]]

            maas       yas
Atil    2.543377 -2.300225
zeynep  0.662080  1.370902
atlas   0.922349 -0.421260
mehmet  1.862720  0.501679

In [33]:
yeniDataFrame.loc["Atil"]

maas             2.543377
yas             -2.300225
calısma saati   -1.561880
Name: Atil, dtype: float64

In [35]:
yeniDataFrame.iloc[0]

maas             2.543377
yas             -2.300225
calısma saati   -1.561880
Name: Atil, dtype: float64

In [36]:
yeniDataFrame

            maas       yas  calısma saati
Atil    2.543377 -2.300225      -1.561880
zeynep  0.662080  1.370902       0.529370
atlas   0.922349 -0.421260       1.456759
mehmet  1.862720  0.501679       1.237591

In [38]:
yeniDataFrame["emeklilik yaşı"]= yeniDataFrame["yas"]+ yeniDataFrame["yas"]
yeniDataFrame

            maas       yas  calısma saati  emeklilik yaşı
Atil    2.543377 -2.300225      -1.561880       -4.600450
zeynep  0.662080  1.370902       0.529370        2.741803
atlas   0.922349 -0.421260       1.456759       -0.842520
mehmet  1.862720  0.501679       1.237591        1.003358

In [39]:
yeniDataFrame.loc["Atil"]["yas"] #bu ve aşağıdaki aynı şeydir.

-2.3002251948608077

In [41]:
yeniDataFrame.loc["Atil","yas"]

-2.3002251948608077

In [42]:
yeniDataFrame <0

         maas    yas  calısma saati  emeklilik yaşı
Atil    False   True           True            True
zeynep  False  False          False           False
atlas   False   True          False            True
mehmet  False  False          False           False

In [43]:
yeniDataFrame["yas"] >0

Atil      False
zeynep     True
atlas     False
mehmet     True
Name: yas, dtype: bool

In [46]:
yeniDataFrame.reset_index()

    index      maas       yas  calısma saati  emeklilik yaşı
0    Atil  2.543377 -2.300225      -1.561880       -4.600450
1  zeynep  0.662080  1.370902       0.529370        2.741803
2   atlas  0.922349 -0.421260       1.456759       -0.842520
3  mehmet  1.862720  0.501679       1.237591        1.003358

In [47]:
yeniDataFrame

            maas       yas  calısma saati  emeklilik yaşı
Atil    2.543377 -2.300225      -1.561880       -4.600450
zeynep  0.662080  1.370902       0.529370        2.741803
atlas   0.922349 -0.421260       1.456759       -0.842520
mehmet  1.862720  0.501679       1.237591        1.003358

In [48]:
ilkındeksler=["Sımpson","Sımpson","Sımpson","South Park","South Park","South Park"]
icindeksler= ["Homer", "Bart", "Merge","Cartman", "Kenny","Kyle"]
birlesmisIndeks= list(zip(ilkındeksler,icindeksler))
birlesmisIndeks

[('Sımpson', 'Homer'),
 ('Sımpson', 'Bart'),
 ('Sımpson', 'Merge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [49]:
birlesmisIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks)
birlesmisIndeks

MultiIndex([(   'Sımpson',   'Homer'),
            (   'Sımpson',    'Bart'),
            (   'Sımpson',   'Merge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [50]:
benimcizgifilmlistem= [[40,"A"],[30,"B"], [20,"C"], [10,"D"], [20, "E"], [30,"F"]]
cizgiFilmNumpyDizisi= np.array(benimcizgifilmlistem)
cizgiFilmDataFrame= pd.DataFrame(cizgiFilmNumpyDizisi, index= birlesmisIndeks, columns= ["yas", "meslek"])
cizgiFilmDataFrame

                   yas meslek
Sımpson    Homer    40      A
           Bart     30      B
           Merge    20      C
South Park Cartman  10      D
           Kenny    20      E
           Kyle     30      F

In [52]:
sozlukverisi= {"İstanbul": [30,29, np.nan], "Ankara": [20, np.nan,25], "İzmir": [40,39,38]}
havadurumuDataFrame= pd.DataFrame(sozlukverisi)
havadurumuDataFrame

   İstanbul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38